crud_v2/app/Controllers/ElementStatus.php

    public function index()
    {
        $this->data['title'] = "ELEMENT STATUS";
        $this->data[$this->model] = $this->ElementStatusModel->orderBy($this->primarykey, 'ASC')->findAll();
---
SELECT *
FROM `element_status`
ORDER BY `Element_status_id` ASC