crud_v2/app/Controllers/Element.php

    public function index()
    {
        $this->data['title'] = "ELEMENTS";
        $this->data[$this->model] = $this->elementModel->sp_elements();
        $this->data['categories'] = $this->categoryModel->orderBy('Category_id', 'ASC')->findAll();
        $this->data['element_status'] = $this->elementStatusModel->orderBy('Element_status_id', 'ASC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `Category_id` ASC
SELECT *
FROM `element_status`
ORDER BY `Element_status_id` ASC