crud_v2/app/Controllers/UserStatus.php

    public function index()
    {
        $this->data['title'] = "USER STATUS";
        $this->data[$this->model] = $this->StatusModel->orderBy($this->primarykey, 'ASC')->findAll();
---
SELECT *
FROM `user_status`
ORDER BY `User_status_id` ASC

    public function update(){
        if($this ->request->isAJAX()){
            $today = date("Y-m-d H:i:s");
            $id = $this->request->getVar($this->primarykey);
            $dataModel=[
                'User_status_name' => $this->request->getVar('User_status_name'),
                'User_status_description' => $this->request->getVar('User_status_description'),
                'update_at' => $today
            ];
            if($this->StatusModel->update($id, $dataModel)){
---
UPDATE `user_status` SET `User_status_name` = 'Bloqueado', `User_status_description` = 'This is Bloqueada', `update_at` = '2024-05-20 17:28:23'
WHERE `user_status`.`User_status_id` IN ('3')