crud_v2/app/Controllers/User.php

    public function index()
    {
        $this->data['title'] = "USERS";
        $this->data[$this->model] = $this->userModel->sp_users();
        $this->data['roles'] = $this->roleModel->orderBy('Roles_id', 'ASC')->findAll();
        $this->data['user_status'] = $this->userStatusModel->orderBy('User_status_id', 'ASC')->findAll();
---
SELECT *
FROM `roles`
ORDER BY `Roles_id` ASC
SELECT *
FROM `user_status`
ORDER BY `User_status_id` ASC