app/Controllers/Category.php

SELECT *
FROM `categories`
ORDER BY `Category_id` ASC
---
    public function index()
    {
        $this->data['title'] = "CATEGORIES";
        $this->data[$this->model] = $this->categoryModel->orderBy($this->primarykey, 'ASC')->findAll();