app/Controllers/Dashboard.php

SELECT *
FROM `profiles`
WHERE `User_fk` = 18
 LIMIT 1
---
    public function index()
    {
        $this->data['title'] = 'DASHBOARD';
        $this->data['profile'] = $this->profileModel->where('User_fk', (int)$this->getSessionIdUser()['User_id'])->first();