app/Controllers/Element.php

    public function index()
    {
        $this->data['title'] = "ELEMENTS";
        $this->data[$this->model] = $this->elementModel->sp_elements();
        $this->data['categories'] = $this->categoryModel->orderBy('Category_id', 'ASC')->findAll();
        $this->data['brands'] = $this->brandModel->orderBy('Brand_id', 'ASC')->findAll();
        $this->data['models'] = $this->modelModel->orderBy('Model_id', 'ASC')->findAll();
        $this->data['element_status'] = $this->elementStatusModel->orderBy('Element_status_id', 'ASC')->findAll();
        $this->data['profile'] = $this->profileModel->where('user_fk', (int)$this->getSessionIdUser()['User_id'])->first();
---
SELECT *
FROM `categories`
ORDER BY `Category_id` ASC
SELECT *
FROM `brands`
ORDER BY `Brand_id` ASC
SELECT *
FROM `models`
ORDER BY `Model_id` ASC
SELECT *
FROM `element_status`
ORDER BY `Element_status_id` ASC
SELECT *
FROM `profiles`
WHERE `user_fk` = 2
 LIMIT 1