app/Controllers/ElementStatus.php

SELECT *
FROM `element_status`
WHERE `Element_status_id` = '1'
 LIMIT 1
---
    public function singleElementStatus($id = null)
    {
        if($this->request->isAJAX()){
            if($data[$this->model] = $this->ElementStatusModel->where($this->primarykey, $id)->first()){