app/Controllers/Element.php

    public function create()
    {
        if($this->request->isAJAX()){
            $dataModel = $this->getDataModel();

            if($this->elementModel->insert($dataModel)){
---
INSERT INTO `elements` (`Element_nombre`, `Element_imagen`, `Element_serial`, `Element_procesador`, `Element_memoria_ram`, `Element_valor`, `Element_stock`, `Category_fk`, `Element_status_fk`, `Brand_fk`, `update_at`) VALUES ('PORTATIL', 'QWEQ', 'EQWEQWE', 'CORE 5 3! GEN', '8', '2000000', NULL, '1', '1', NULL, '')