app/Controllers/Model.php

SELECT *
FROM `models`
ORDER BY `Model_id` ASC
SELECT *
FROM `profiles`
WHERE `User_fk` = 1
 LIMIT 1
---
    public function index()
    {
        $this->data['title'] = "MODELS";
        $this->data[$this->model] = $this->modelModel->orderBy($this->primarykey, 'ASC')->findAll();
        $this->data['profile'] = $this->profileModel->where('User_fk',(int)$this->getSessionIdUser()['User_id'])->first();