app/Controllers/Module.php

UPDATE `modules` SET `Modules_name` = 'Dashboar', `Modules_description` = 'This is dashboard', `Modules_route` = 'dashboard', `Modules_icon` = 'bi-speedometer', `Modules_submodule` = 0, `Modules_parent_module` = 'NULL', `update_at` = '2024-10-27 16:12:47'
WHERE `modules`.`Modules_id` IN ('1')
---
    public function update()
    {
        if($this->request->isAJAX())
        {
            $today = data("y-m-d H:i:s");
            $id = $this->request->getVar($this->primaryKey);
            $dataModel = [
                'Modules_name' => $this->request->getVar('Modules_name'),
                'Modules_description' => $this->request->getVar('Modules_description'),
                'Modules_route' => $this->request->getVar('Modules_route'),
                'Modules_icon' => $this->request->getVar('Modules_icon'),
                'Modules_submodule' => $this->request->getVar('Modules_submodule'),
                'Modules_parent_module' => $this->request->getVar('Modules_parent_module'),
                'update_at' => $today
            ];
            if($this->moduleModel->update($id, $dataModel)){