app/Controllers/RequestStatus.php

INSERT INTO `request_status` (`Request_status_name`, `Request_status_description`, `update_at`) VALUES ('EN EJECUCION', 'EN EJECUCION', '')
---
    public function create()
    {
        if($this->request->isAJAX()){
            $dataModel = $this->getDataModel();

            if($this->RequestStatusModel->insert($dataModel)){