app/Controllers/Request.php

SELECT *
FROM `elements`
ORDER BY `Element_id` ASC
SELECT *
FROM `request_status`
ORDER BY `Request_status_id` ASC
SELECT *
FROM `requests`
WHERE `User_fk` = 3
 LIMIT 1
SELECT *
FROM `profiles`
WHERE `User_fk` = 3
 LIMIT 1
---
    public function index()
    {
        $this->data['title'] = "REQUEST";
        //$this->data[$this->model] = $this->requestModel->where('User_fk',(int)$this->getSessionIdUser()['User_id'])->findAll();
        $this->data[$this->model] = $this->requestModel
        ->select('requests.*, request_status.Request_status_name') // Asegúrate de incluir los campos necesarios
        ->join('request_status', 'requests.Request_status_fk = request_status.Request_status_id', 'left') // Ajusta según tu relación
        ->where('User_fk', (int)$this->getSessionIdUser()['User_id'])
        ->findAll();
        $this->data['elements'] = $this->elementModel->orderBy('Element_id', 'ASC')->findAll();
        $this->data['request_status'] = $this->requestStatusModel->orderBy('Request_status_id', 'ASC')->findAll();
        $this->data['profiles'] = $this->profileModel->where('User_fk',(int)$this->getSessionIdUser()['User_id'])->first();