app/Controllers/Role.php

INSERT INTO `roles` (`Roles_name`, `Roles_description`, `update_at`) VALUES ('Administrador', 'This is Administrador', '')
---
    public function create()
    {
        if($this->request->isAJAX()){
            $dataModel = $this->getDataModel();

            if($this->RoleModel->insert($dataModel)){