app/Controllers/RoleModule.php

    public function index()
    {
        $this->data['title'] = "ROLE MODULES";
        $this->data['titlePermissions'] = "MODULE PERMISSIONS";
<<<<<<< Updated upstream
        $this->data[$this->model] = $this->roleModuleModel->orderBy($this->primaryKey, 'ASC')->findAll();
=======
        $this->data[$this->model] = $this->roleModuleModel->sp_role_modules();
>>>>>>> Stashed changes
        $this->data['roles'] = $this->roleModel->orderBy('Roles_id', 'ASC')->findAll();
        $this->data['modules'] = $this->moduleModel->orderBy('Modules_id', 'ASC')->findAll();
        $this->data['permissions'] = $this->permissionModel->orderBy('Permissions_id', 'ASC')->findAll();
        $this->data['profiles'] = $this->profileModel->where('User_fk',(int)$this->getSessionIdUser()['User_id'])->first();
---
SELECT *
FROM `roles`
ORDER BY `Roles_id` ASC
SELECT *
FROM `modules`
ORDER BY `Modules_id` ASC
SELECT *
FROM `permissions`
ORDER BY `Permissions_id` ASC
SELECT *
FROM `profiles`
WHERE `User_fk` = 1
 LIMIT 1