app/Controllers/UserElement.php

SELECT *
FROM `profiles`
WHERE `User_fk` = 2
 LIMIT 1
SELECT *
FROM `users`
SELECT *
FROM `elements`
---
    public function index()
{
    // Título de la página
    $data['title'] = 'User Elements';

    // Obtener los datos usando el procedimiento almacenado
    $data['user_elements'] = $this->userElementModel->getUserElementDetails();

    // Obtener el perfil del usuario (opcional)
    $data['profile'] = $this->profileModel->where('User_fk', (int)$this->getSessionIdUser()['User_id'])->first();

    // Obtener los módulos del usuario
    $data['userModules'] = $this->roleModulesModel->sp_role_modules_id((int)$this->getSessionIdUser()['Roles_fk']);

    // Obtener los módulos del usuario
    $data['users'] = $this->userModel->findAll();

    $data['elements'] = $this->elementModel->findAll();