app/Controllers/User.php

    public function index()
    {
        $this->data['title'] = "USERS";
        $this->data[$this->model] = $this->userModel->sp_users();
        $this->data['roles'] = $this->roleModel->orderBy('Roles_id', 'ASC')->findAll();
        $this->data['user_status'] = $this->userStatusModel->orderBy('User_status_id', 'ASC')->findAll();
        $this->data['cities'] = $this->cityModel->orderBy('City_id', 'ASC')->findAll();
        $this->data['areas'] = $this->areaModel->orderBy('Area_id', 'ASC')->findAll();
        $this->data['profile'] = $this->profileModel->where('user_fk', (int)$this->getSessionIdUser()['User_id'])->first();
---
SELECT *
FROM `roles`
ORDER BY `Roles_id` ASC
SELECT *
FROM `user_status`
ORDER BY `User_status_id` ASC
SELECT *
FROM `cities`
ORDER BY `City_id` ASC
SELECT *
FROM `areas`
ORDER BY `Area_id` ASC
SELECT *
FROM `profiles`
WHERE `user_fk` = 18
 LIMIT 1

    public function create()
    {
        if($this->request->isAJAX()){
            $dataModel = $this->getDataModel();

            if($this->userModel->insert($dataModel)){
---
INSERT INTO `users` (`User_documento`, `User_nombre`, `User_apellido_paterno`, `User_apellido_materno`, `User_telefono`, `User_correo`, `User_password`, `City_fk`, `Area_fk`, `Roles_fk`, `User_status_fk`, `update_at`) VALUES ('1022441593', 'brayan', 'acosta', 'lozano', '3197871256', 'brayan@gmail.com', '$2y$10$eYkz6L2OuM48wioKHblDhuKWGPP4IzJGP6KY//65UpNASeJPfoB6W', '3', '4', '1', '1', '')