app/Controllers/UserStatus.php

    public function index()
    {
        $this->data['title'] = "USER STATUS";
        $this->data[$this->model] = $this->StatusModel->orderBy($this->primarykey, 'ASC')->findAll();
---
SELECT *
FROM `user_status`
ORDER BY `User_status_id` ASC